{
  "Active Directory & GPO": {
    "description": "Mise en place d’un domaine Windows Server et gestion des politiques centralisées",
    "images": ["./images/ad1.jpg", "./images/ad2.jpg"],
    "links": []
  },
  "Administration Linux": {
    "description": "Debian, Ubuntu Scripting Bash et Python, automatisation avec Ansible",
    "images": ["./images/linux1.jpg","./images/linux2.jpg"],
    "links": []
  },
  "Sécurisation et gestion réseau": {
    "description": "Mise en place et configuration d’un pare-feu pfSense pour protéger et gérer un réseau d’entreprise. Création de règles de filtrage et de NAT afin de contrôler les flux entrants et sortants. Déploiement de VPN (OpenVPN / IPSec) pour sécuriser les connexions distantes. Mise en place d’un portail captif avec authentification des utilisateurs pour réguler l’accès au réseau local. Configuration du DHCP et DNS interne pour automatiser l’attribution d’adresses IP et améliorer la résolution des noms. Paramétrage de la QoS afin de prioriser les flux critiques (visioconférence, VoIP). Enfin, mise en œuvre de l’équilibrage de charge et de la haute disponibilité entre plusieurs liaisons Internet pour garantir la continuité de service.",
    "images": ["./images/sys/pfsense1.png", "./images/sys/pfsense2.png", "./images/sys/pfsense3.png",
    "./images/sys/pfsense4.png", "./images/sys/pfsense5.png", "./images/sys/pfsense6.png"],
    "links": []
  },
  "Gestion de parc informatique": {
    "description": "Déploiement et configuration de GLPI (Gestion Libre de Parc Informatique) pour centraliser la gestion des actifs IT et des tickets d’assistance. Le projet a consisté à inventorier le parc matériel et logiciel, mettre en place un système de helpdesk pour le suivi des demandes utilisateurs, et automatiser la gestion des incidents et des changements. Des plugins complémentaires ont été intégrés pour améliorer le reporting et le suivi des licences. Cette solution a permis d’optimiser la visibilité sur les ressources informatiques, de professionnaliser le support technique et d’améliorer la traçabilité des interventions au sein de l’entreprise.",
    "images": ["./images/sys/glpi1.png", "./images/sys/glpi2.png", "./images/sys/glpi3.png", 
    "./images/sys/glpi4.png", "./images/sys/glpi5.png", "./images/sys/glpi6.png"],
    "links": []
  },
  "Sécurisation des réseaux": {
    "description": "Mise en place d’une solution de firewall basée sur IPCop pour sécuriser un réseau local d’entreprise. Le projet a consisté à segmenter le réseau en zones (Green pour le LAN interne, Red pour l’accès Internet, Orange pour la DMZ, Blue pour le Wi-Fi), à configurer un firewall iptables avec filtrage des flux, du NAT et un proxy Squid pour contrôler la navigation web. Des VPN (IPSec / OpenVPN) ont été déployés pour sécuriser les connexions distantes, et un IDS/IPS Snort a été intégré pour la détection d’intrusions. Cette architecture a permis de renforcer la sécurité réseau tout en assurant une gestion simple via l’interface web d’IPCop, offrant une solution fiable et adaptée aux besoins d’une PME.",
    "images": ["./images/sys/ipcop1.jpg", "./images/sys/ipcop2.jpg", "./images/sys/ipcop3.jpg",
    "./images/sys/ipcop4.jpg", "./images/sys/ipcop5.jpg", "./images/sys/ipcop6.jpg", "./images/sys/ipcop7.jpg"],
    "links": ["https://biblio.univ-antananarivo.mg/theses2/"]
  },
  "Application Android ECommerce": {
    "description": "L'application ”ECommerce” est une plateforme intuitive qui permet aux utilisateurs, qu'ils soient clients ou fournisseurs, d'interagir avec les fonctionnalités d'un système de commerce électronique. Cette application prend en charge deux langues : le français et l'anglais, selon la langue du système de l'utilisateur. Elle combine Java, Room Database, RecyclerView et l'architecture MVVM pour offrir une application robuste, performante et évolutive. Les entités, DAO, adaptateurs et autres composants garantissent une gestion efficace des données et une interface utilisateur intuitive.",
    "images": ["./images/dev/android1.png", "./images/dev/android2.png", "./images/dev/android3.png", 
    "./images/dev/android4.png", "./images/dev/android5.png", "./images/dev/android6.png", 
    "./images/dev/android7.png", "./images/dev/android8.png", "./images/dev/android9.png", 
    "./images/dev/android10.png", "./images/dev/android11.png", "./images/dev/android10.png"],
    "links": ["https://www.youtube.com/watch?v=8_laf1ryBOA"]
  },
  "Gestion des campus de l'UM": {
    "description": "Ce projet utilise le Spring Framework, une plateforme robuste et flexible pour créer des applications Java. L'objectif est de concevoir une application web en utilisant Spring Boot, qui simplifie la configuration et le déploiement des applications Spring. Le projet inclut la configuration d'un projet Spring Boot, le développement de contrôleurs, de services et de modèles pour gérer les requêtes HTTP et les données, l'intégration d'une base de données relationnelle avec Spring Data JPA, et la mise en place de mesures de sécurité avec Spring Security pour protéger l'application. Ce projet permet de se familiariser avec les concepts clés de Spring et de développer une application web complète de bout en bout. ",
    "images": ["./images/dev/um1.png", "./images/dev/um2.png", "./images/dev/um3.png",
    "./images/dev/um4.png", "./images/dev/um5.png", "./images/dev/um6.png",
    "./images/dev/um7.png", "./images/dev/um8.png", "./images/dev/um9.png",
    "./images/dev/um10.png", "./images/dev/um11.png", "./images/dev/um12.png"],
    "links": ["https://github.com/2Randi/JEE-project"]
  },
  "Fake news detection": {
    "description": "Ce projet s’inscrit dans le cadre de l’apprentissage supervisé appliqué à un problème de binary et multi-class classification. Le dataset utilisé contient des articles de presse labellisés (real, fake, mixture, other). Le preprocessing a consisté en plusieurs étapes : tokenization, stopword removal, stemming/lemmatization, puis feature extraction avec TF-IDF vectorization et bag of words. Sur ces données transformées, différents classifiers ont été entraînés et comparés, notamment Naive Bayes, Decision Tree, Logistic Regression, Support Vector Machine (SVM) et Random Forest. L’évaluation des modèles a été réalisée à l’aide de quatre métriques : Accuracy, Precision, Recall et F1-Score. Les résultats ont permis d’identifier le modèle le plus performant, mettant en évidence sa capacité à généraliser efficacement pour la tâche de fake news detection.",
    "images": ["./images/dev/ML1.jpg", "./images/dev/ML2.jpg", "./images/dev/ML3.jpg",
    "./images/dev/ML4.jpg", "./images/dev/ML5.jpg", "./images/dev/ML6.jpg"],
    "links": ["https://colab.research.google.com/drive/1RQz8Qlx4SWVqqvRFqB-NIp1RrWqkb7MP#scrollTo=P9c4QKyUrCRi"]
  },
  "Transmission optique sans fil": {
    "description": "L’évolution des systèmes de télécommunication tend vers une augmentation des capacités de transmission. La transmission optique en espace libre utilise des sources lumineuses comme le laser ou LED. Le support utilisé est l’air libre. Le signal électrique est transformé en signal optique pour qu’il s’adapte au système sans fil, par la modulation optique. Libre licence, haute sécurité, facile à installer, débit binaire élevé sont ses principaux avantages. La brume et le brouillard sont des facteurs qui influencent le système FSO. L'utilisation du système à émetteur/récepteur multiple a augmenté l'efficacité des systèmes soumis à différentes perturbations. Le taux d'erreur binaire et le facteur de qualité sont les indicateurs qui permettent de qualifier la performance de la transmission. Le système à émetteur/récepteur multiple possède un taux d’erreur faible et un facteur de qualitéélevé d’après la simulation sous le logiciel OptiSystem. Mots clés : modulation optique, lumière, espace libre, TEB et facteur de Qualité.",
    "images": ["./images/telecom/fso1.jpg", "./images/telecom/fso2.jpg", "./images/telecom/fso3.jpg",
    "./images/telecom/fso4.jpg", "./images/telecom/fso5.jpg", "./images/telecom/fso6.jpg", "./images/telecom/fso7.jpg"],
    "links": ["https://biblio.univ-antananarivo.mg/theses2/"]
  },
  "Voice over Internet Protocol": {
    "description": "Déploiement et configuration de Wazo Platform pour mettre en place une solution de téléphonie IP complète. Installation du serveur et intégration avec le réseau local pour gérer les communications internes et externes. Création et administration de comptes SIP pour les utilisateurs, configuration des trunks SIP pour la liaison avec l’opérateur téléphonique OVH, et mise en place de dialplan personnalisés. Mise en œuvre de fonctionnalités avancées telles que messagerie vocale, transferts d’appel, files d’attente et conférence audio. Intégration avec l’annuaire d’entreprise LDAP pour simplifier la gestion des utilisateurs. Migration du serveur dans le OVH Cloud. Enfin, supervision et suivi des appels (CDR, enregistrements, rapports) via l’interface d’administration Wazo.",
    "images": ["./images/telecom/wazo1.png", "./images/telecom/wazo2.png", "./images/telecom/wazo3.png",
    "./images/telecom/wazo4.png", "./images/telecom/wazo5.png", "./images/telecom/wazo6.jpg", ],
    "links": ["https://www.elastic.co/what-is/elk-stack"]
  }
}

